trug-rails/lib/tasks/migrate_meetups.rake

SELECT "meetups".* FROM "meetups" WHERE "meetups"."number" = 115 LIMIT 1
---
  task migrate_from_yaml: :environment do
    yaml_path = Rails.root.join("..", "data", "meetups.yml")

    unless File.exist?(yaml_path)
      puts "ERROR: Could not find meetups.yml at #{yaml_path}"
      exit 1
    end

    data = YAML.load_file(yaml_path)
    events = data["events"]

    puts "Found #{events.count} meetups to import..."

    meetups_created = 0
    talks_created = 0

    ActiveRecord::Base.transaction do
      events.each do |event|
        meetup = Meetup.find_or_initialize_by(number: event["number"])

INSERT INTO "talks" ("meetup_id", "title", "speaker_name", "speaker_homepage", "slides_url", "source_code_url", "video_id", "video_provider", "video_thumb", "created_at", "updated_at") VALUES (1, 'Open Telemetry w codziennej pracy developera', 'Adam Okoń', NULL, NULL, NULL, NULL, NULL, NULL, '2026-01-22 17:51:27.369043', '2026-01-22 17:51:27.369043') RETURNING "id"
---
            video_provider: talk_data["video_provider"],
            video_thumb: video_thumb
          )
          talk.save!

SELECT COUNT(*) FROM "meetups"
SELECT COUNT(*) FROM "talks"
---
    puts "  - #{meetups_created} new meetups"
    puts "  - #{talks_created} new talks"
    puts ""
    puts "Total meetups in database: #{Meetup.count}"
    puts "Total talks in database: #{Talk.count}"

SELECT COUNT(*) FROM "talks" WHERE "talks"."video_provider" = 'vimeo' AND ("talks"."video_thumb" = '' OR "talks"."video_thumb" IS NULL)
SELECT "talks".* FROM "talks" WHERE "talks"."video_provider" = 'vimeo' AND ("talks"."video_thumb" = '' OR "talks"."video_thumb" IS NULL) ORDER BY "talks"."id" ASC LIMIT 1000
---
  task fetch_vimeo_thumbs: :environment do
    talks = Talk.where(video_provider: "vimeo").where(video_thumb: [ nil, "" ])
    puts "Found #{talks.count} Vimeo talks without thumbnails..."

    talks.find_each do |talk|
      next if talk.video_id.blank?

      thumb = fetch_vimeo_thumb(talk.video_id)
      if thumb
        talk.update!(video_thumb: thumb)
        puts "  Updated talk ##{talk.id}: #{talk.title[0..50]}..."
        sleep 0.5
      end
    end

    puts "Done! Remaining talks without thumbs: #{Talk.where(video_provider: 'vimeo').where(video_thumb: [ nil, '' ]).count}"