app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "meetups"
SELECT COUNT(*) FROM "talks"
---
  def index
    @meetups_count = Meetup.count
    @talks_count = Talk.count