app/controllers/admin/meetups_controller.rb

  def index
    @meetups = Meetup.order(date: :desc).includes(:talks)
---
SELECT "meetups".* FROM "meetups" ORDER BY "meetups"."date" DESC