app/controllers/admin/meetups_controller.rb

  def index
    @meetups = Meetup.ordered.includes(:talks)
    @meetups = @meetups.where(event_type: params[:type]) if params[:type].present?
    @total_meetups = Meetup.count
    @upcoming_meetups = Meetup.upcoming.count
    @total_talks = Talk.count
---
SELECT COUNT(*) FROM "talks" WHERE "talks"."meetup_id" = 1

  def show
    @meetup = Meetup.includes(:talks).find(params[:id])
---
SELECT "meetups".* FROM "meetups" WHERE "meetups"."id" = 1 LIMIT 1

  def new
    next_number = Meetup.formal.maximum(:number).to_i + 1
---
SELECT MAX("meetups"."number") FROM "meetups"

  def create
    @meetup = Meetup.new(meetup_params)
    if @meetup.save
---
INSERT INTO "meetups" ("number", "date", "location", "description", "created_at", "updated_at") VALUES (200, '2030-01-01', 'Gdynia', 'aaaaaaaaaaaaaaaa', '2026-01-22 18:57:53.393544', '2026-01-22 18:57:53.393544') RETURNING "id"

  def edit
    @meetup = Meetup.find(params[:id])
---
SELECT "meetups".* FROM "meetups" WHERE "meetups"."id" = 1 LIMIT 1

  def update
    @meetup = Meetup.find(params[:id])
---
SELECT "meetups".* FROM "meetups" WHERE "meetups"."id" = 109 LIMIT 1

  def destroy
    @meetup = Meetup.find(params[:id])
    @meetup.destroy
---
SELECT "meetups".* FROM "meetups" WHERE "meetups"."id" = 109 LIMIT 1
DELETE FROM "meetups" WHERE "meetups"."id" = 109