app/controllers/admin/talks_controller.rb

  def create
    @talk = @meetup.talks.new(talk_params)
    if @talk.save
---
INSERT INTO "talks" ("meetup_id", "title", "speaker_name", "speaker_homepage", "slides_url", "source_code_url", "video_id", "video_provider", "video_thumb", "created_at", "updated_at") VALUES (109, 'AI', 'Oskar', '', '', '', '', '', '', '2026-01-22 18:58:34.694639', '2026-01-22 18:58:34.694639') RETURNING "id"

  def set_meetup
    @meetup = Meetup.find(params[:meetup_id])
---
SELECT "meetups".* FROM "meetups" WHERE "meetups"."id" = 109 LIMIT 1