app/views/admin/dashboard/index.html.erb

SELECT COUNT(*) FROM "meetups"
SELECT COUNT(*) FROM "talks" WHERE "talks"."meetup_id" = 2
---
            <span class="meetup-location"><%= meetup.location %></span>
            <span class="meetup-talks"><%= meetup.talks.count %> prezentacji</span>