trug-rails/app/views/pages/home.html.erb

          <td>
            <% if @next_meetup && @next_meetup.talks.any? %>
              <% @next_meetup.talks.each do |talk| %>
---
SELECT "talks".* FROM "talks" WHERE "talks"."meetup_id" = 2 ORDER BY "talks"."id" ASC LIMIT 1
SELECT 1 AS one FROM "talks" WHERE "talks"."meetup_id" = 1 LIMIT 1
SELECT "talks".* FROM "talks" WHERE "talks"."meetup_id" = 1

          <% if authenticated? && current_user.github_username %>
            <% user_attendance = @next_meetup.attendances.find_by(github_username: current_user.github_username) %>
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."meetup_id" = 1 AND "attendances"."github_username" = 'gotar' LIMIT 1