app/models/user.rb

  def self.from_github(github_data)
    user = find_or_initialize_by(github_id: github_data["id"].to_s)
    unless user.persisted?
      user.github_username = github_data["login"]
      user.email_address = github_data["email"] || "#{github_data["login"]}@github.local"
      user.password = SecureRandom.hex(32)
      user.save!
---
INSERT INTO "users" ("email_address", "password_digest", "created_at", "updated_at", "github_id", "github_username") VALUES ('@github.local', '$2a$12$phUcqs.s/1FxL5HYLWf/L.5weWn/eJ9nGaCW4MFuii9zEh2TUAn02', '2026-01-22 18:46:04.393481', '2026-01-22 18:46:04.393481', '', NULL) RETURNING "id"

  def github?
    github_id.present?
---
SELECT "users".* FROM "users" WHERE "users"."github_id" = '' LIMIT 1