trug-rails/app/views/admin/meetups/index.html.erb

            <td><%= l meetup.date, format: :long %></td>
            <td><span class="talks-count"><%= meetup.talks.count %></span></td>
---
SELECT COUNT(*) FROM "talks" WHERE "talks"."meetup_id" = 1